rgregg/esp32-wireless-thermostat/src/main.cpp
void ctrl_publish_runtime_state() {
  if (g_controller == nullptr || !g_ctrl_mqtt.connected()) {
    return;
  }
  const auto &rt = g_controller->app().runtime();
  const bool lockout = rt.hvac_lockout();
  const auto snap = rt.snapshot();
  const char *mode = "off";
  if (snap.mode == FurnaceMode::Heat) mode = "heat";
  if (snap.mode == FurnaceMode::Cool) mode = "cool";
  const char *fan = "auto";
  if (snap.fan_mode == FanMode::AlwaysOn) fan = "on";
  if (snap.fan_mode == FanMode::Circulate) fan = "circulate";

  char buf[32];
  g_ctrl_mqtt.publish(ctrl_topic_for("state/availability").c_str(), "online", true);
  g_ctrl_mqtt.publish(ctrl_topic_for("state/lockout").c_str(), lockout ? "1" : "0", true);
  g_ctrl_mqtt.publish(ctrl_topic_for("state/mode").c_str(), mode, true);
  g_ctrl_mqtt.publish(ctrl_topic_for("state/fan_mode").c_str(), fan, true);
  snprintf(buf, sizeof(buf), "%.1f", rt.target_temperature_c());
  g_ctrl_mqtt.publish(ctrl_topic_for("state/target_temp_c").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%.2f", rt.filter_runtime_hours());
  g_ctrl_mqtt.publish(ctrl_topic_for("state/filter_runtime_hours").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%u", static_cast<unsigned>(rt.furnace_state()));
  g_ctrl_mqtt.publish(ctrl_topic_for("state/furnace_state").c_str(), buf, true);
  g_ctrl_have_lockout = true;
  g_ctrl_last_lockout = lockout;
}

void ctrl_apply_mqtt_shadow(bool do_sync, bool do_filter_reset) {
  if (g_controller == nullptr || !g_ctrl_have_shadow) {
    return;
  }
  CommandWord cmd;
  cmd.mode = g_ctrl_shadow_mode;
  cmd.fan = g_ctrl_shadow_fan;
  int setpoint_decic = static_cast<int>(g_ctrl_shadow_setpoint_c * 10.0f + 0.5f);
  if (setpoint_decic < 0) setpoint_decic = 0;
  if (setpoint_decic > 400) setpoint_decic = 400;
  cmd.setpoint_decic = static_cast<uint16_t>(setpoint_decic);
  g_ctrl_mqtt_seq = static_cast<uint16_t>((g_ctrl_mqtt_seq + 1) & 0x1FFu);
  if (g_ctrl_mqtt_seq == 0) g_ctrl_mqtt_seq = 1;
  cmd.seq = g_ctrl_mqtt_seq;
  cmd.sync_request = do_sync;
  cmd.filter_reset = do_filter_reset;
  g_controller->app().on_command_word(espnow_cmd::encode(cmd));
  g_ctrl_last_mqtt_command_ms = millis();
  ctrl_publish_runtime_state();
}

void ctrl_mqtt_on_message(char *topic, uint8_t *payload, unsigned int length) {
  if (topic == nullptr || payload == nullptr) {
    return;
  }

  char value[128];
  const size_t copy_len = (length < sizeof(value) - 1) ? length : sizeof(value) - 1;
  memcpy(value, payload, copy_len);
  value[copy_len] = '\0';

  const String topic_str(topic);
  const String cfg_prefix = ctrl_topic_for("cfg/");
  if (topic_str.startsWith(cfg_prefix) && topic_str.endsWith("/set")) {
    const int key_begin = static_cast<int>(cfg_prefix.length());
    const int key_end = static_cast<int>(topic_str.length()) - 4;
    if (key_end > key_begin) {
      const String key = topic_str.substring(key_begin, key_end);
      ctrl_try_update_runtime_config(key, value);
    }
    return;
  }

  if (g_controller == nullptr) {
    return;
  }

  if (topic_str == ctrl_topic_for("cmd/lockout")) {
    g_controller->app().set_hvac_lockout(ctrl_parse_bool_payload(value));
    ctrl_publish_runtime_state();
    return;
  }

  // Direct controller command topics
  if (topic_str == ctrl_topic_for("cmd/mode")) {
    if (strcmp(value, "heat") == 0) g_ctrl_shadow_mode = FurnaceMode::Heat;
    else if (strcmp(value, "cool") == 0) g_ctrl_shadow_mode = FurnaceMode::Cool;
    else g_ctrl_shadow_mode = FurnaceMode::Off;
    g_ctrl_have_shadow = true;
    ctrl_apply_mqtt_shadow(false, false);
    return;
  }
  if (topic_str == ctrl_topic_for("cmd/fan_mode")) {
    if (strcmp(value, "on") == 0 || strcmp(value, "always on") == 0) g_ctrl_shadow_fan = FanMode::AlwaysOn;
    else if (strcmp(value, "circulate") == 0) g_ctrl_shadow_fan = FanMode::Circulate;
    else g_ctrl_shadow_fan = FanMode::Automatic;
    g_ctrl_have_shadow = true;
    ctrl_apply_mqtt_shadow(false, false);
    return;
  }
  if (topic_str == ctrl_topic_for("cmd/target_temp_c")) {
    g_ctrl_shadow_setpoint_c = static_cast<float>(atof(value));
    g_ctrl_have_shadow = true;
    ctrl_apply_mqtt_shadow(false, false);
    return;
  }
  if (topic_str == ctrl_topic_for("cmd/sync") && ctrl_parse_bool_payload(value)) {
    ctrl_apply_mqtt_shadow(true, false);
    return;
  }
  if (topic_str == ctrl_topic_for("cmd/filter_reset") && ctrl_parse_bool_payload(value)) {
    ctrl_apply_mqtt_shadow(false, true);
    return;
  }

  // Thermostat state mirror topics (MQTT-primary path)
  if (topic_str == display_topic_for("state/mode")) {
    if (strcmp(value, "heat") == 0) g_ctrl_shadow_mode = FurnaceMode::Heat;
    else if (strcmp(value, "cool") == 0) g_ctrl_shadow_mode = FurnaceMode::Cool;
    else g_ctrl_shadow_mode = FurnaceMode::Off;
    g_ctrl_have_shadow = true;
    ctrl_apply_mqtt_shadow(false, false);
    return;
  }
  if (topic_str == display_topic_for("state/fan_mode")) {
    if (strcmp(value, "on") == 0 || strcmp(value, "always on") == 0) g_ctrl_shadow_fan = FanMode::AlwaysOn;
    else if (strcmp(value, "circulate") == 0) g_ctrl_shadow_fan = FanMode::Circulate;
    else g_ctrl_shadow_fan = FanMode::Automatic;
    g_ctrl_have_shadow = true;
    ctrl_apply_mqtt_shadow(false, false);
    return;
  }
  if (topic_str == display_topic_for("state/target_temp_c")) {
    g_ctrl_shadow_setpoint_c = static_cast<float>(atof(value));
    g_ctrl_have_shadow = true;
    ctrl_apply_mqtt_shadow(false, false);
    return;
  }
}

void ctrl_ensure_wifi_connected(uint32_t now_ms) {
  if (g_ctrl_wifi_reconnect_required) {
    g_ctrl_wifi_reconnect_required = false;
    WiFi.disconnect();
    g_ctrl_last_wifi_attempt_ms = 0;
  }
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }
  if ((now_ms - g_ctrl_last_wifi_attempt_ms) < kCtrlNetworkRetryMs) {
    return;
  }
  g_ctrl_last_wifi_attempt_ms = now_ms;
  if (g_cfg_ctrl_wifi_ssid.length() == 0) {
    WiFi.begin();
  } else {
    WiFi.begin(g_cfg_ctrl_wifi_ssid.c_str(), g_cfg_ctrl_wifi_password.c_str());
  }
}

void ctrl_ensure_mqtt_connected(uint32_t now_ms) {
  if (g_cfg_ctrl_mqtt_host.length() == 0) {
    return;
  }
  if (g_ctrl_mqtt_reconfigure_required) {
    g_ctrl_mqtt_reconfigure_required = false;
    g_ctrl_mqtt_discovery_sent = false;
    g_ctrl_mqtt.disconnect();
  }
  if (WiFi.status() != WL_CONNECTED || g_ctrl_mqtt.connected()) {
    return;
  }
  if ((now_ms - g_ctrl_last_mqtt_attempt_ms) < kCtrlNetworkRetryMs) {
    return;
  }
  g_ctrl_last_mqtt_attempt_ms = now_ms;
  g_ctrl_mqtt.setServer(g_cfg_ctrl_mqtt_host.c_str(), g_cfg_ctrl_mqtt_port);

  bool ok = false;
  if (g_cfg_ctrl_mqtt_user.length() == 0) {
    ok = g_ctrl_mqtt.connect(g_cfg_ctrl_mqtt_client_id.c_str());
  } else {
    ok = g_ctrl_mqtt.connect(g_cfg_ctrl_mqtt_client_id.c_str(), g_cfg_ctrl_mqtt_user.c_str(),
                             g_cfg_ctrl_mqtt_password.c_str());
  }
  if (!ok) {
    return;
  }

  g_ctrl_mqtt.subscribe(ctrl_topic_for("cmd/lockout").c_str());
  g_ctrl_mqtt.subscribe(ctrl_topic_for("cmd/mode").c_str());
  g_ctrl_mqtt.subscribe(ctrl_topic_for("cmd/fan_mode").c_str());
  g_ctrl_mqtt.subscribe(ctrl_topic_for("cmd/target_temp_c").c_str());
  g_ctrl_mqtt.subscribe(ctrl_topic_for("cmd/sync").c_str());
  g_ctrl_mqtt.subscribe(ctrl_topic_for("cmd/filter_reset").c_str());
  g_ctrl_mqtt.subscribe(ctrl_topic_for("cfg/+/set").c_str());
  g_ctrl_mqtt.subscribe(display_topic_for("state/mode").c_str());
  g_ctrl_mqtt.subscribe(display_topic_for("state/fan_mode").c_str());
  g_ctrl_mqtt.subscribe(display_topic_for("state/target_temp_c").c_str());
  ctrl_publish_discovery();
  ctrl_publish_all_cfg_state();
  ctrl_publish_runtime_state();
}

